{
  "testimonials": [
    {
      "name": "Aryaki Alomyan",
      "role": "Singer-Songwriter",
      "testimonial": "Working with Kris is always a refreshing experience. His production style is super creative — he’s not afraid to take risks and try unexpected ideas, and they somehow always work. We’ve collaborated on a bunch of songs, and every time he brings something unique to the table that pushes the track to a whole new level. Beyond the technical skills, he’s just a solid person to work with — chill, focused, and really tuned in to the vibe. Highly recommend him to anyone looking to make something that stands out.",
      "avatar": "/uploads/screenshot-2025-05-26-at-09.20.06.png"
    },
    {
      "name": "Dave Bryce",
      "role": "Producer / Mix & Master Engineer",
      "testimonial": "I’ve worked with Kris on multiple projects now have  seen the development of his production and mixing skills first hand for over the last 10 years. \n\nHe’s really committed himself to big, ambitious projects — writing, arranging, and producing full records on his own. He’s naturally gifted as a guitarist, but he’s taken things so much further by learning to shape full tracks in the box, diving deep into synths, sound design, and all kinds of instruments to match the scale of his musical ideas. That curiosity and work ethic has paid off — his productions now have real depth, intention, and a unique sound.\n\nI’ve had the chance to mix several of his records, and it’s been clear with each one how much he’s taken in. He’s developed a solid understanding of how to approach a mix even from the early production stages, and every project he’s brought me has sounded better and more refined than the last. He’s become a well-rounded producer who deeply understands his process and vision for music.",
      "avatar": "/uploads/screenshot-2025-05-26-at-09.23.17.png"
    },
    {
      "name": "Ashe O'Hara",
      "role": "Singer-Songwriter",
      "testimonial": "As a long time friend and collaborator of Kris’, I have always been amazed by his skill and talent. His work expresses deeply his passion and attention to detail, and he has only become more proficient with time. I’ve had the pleasure of collaborating on personal projects, alongside his own creative pursuits and I have always been extremely proud of the music we have made. I will always be a satisfied client of Kris’. ",
      "avatar": "/uploads/whatsapp-image-2025-05-13-at-14.03.15.jpeg"
    }
  ]
}
